Revit 2027 API
GroupTypeId.EnergyAnalysisDetailedModel Property
 Detailed Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisDetailedModel { get; }
Public Shared ReadOnly Property EnergyAnalysisDetailedModel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisDetailedModel {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisDetailedModel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace